{"media":"movie","mediaStr":"Movies","youtube":"9BPMTr-NS9s","year":"2021","genre":"Animation, Adventure, Fantasy, Family, Action","name":"Raya and the Last Dragon","rate":"4.1","casts":[{"name":"Kelly Marie Tran","photo":"https://image.tmdb.org/t/p/w500/v2daUrk7hZryH6vtCWK9ESf6gAG.jpg","id":1663195},{"name":"Awkwafina","photo":"https://image.tmdb.org/t/p/w500/l5AKkg3H1QhMuXmTTmq1EyjyiRb.jpg","id":1625558},{"name":"Izaac Wang","photo":"https://image.tmdb.org/t/p/w500/bzvi6adMl3zmzC7gWhS4cmO61S4.jpg","id":2362044},{"name":"Gemma Chan","photo":"https://image.tmdb.org/t/p/w500/srz0uSI4tDsuxTDXMzLwsEY44Wy.jpg","id":97576},{"name":"Daniel Dae Kim","photo":"https://image.tmdb.org/t/p/w500/aXbTKgL4u6oVumQ459B9VkGTn4A.jpg","id":18307},{"name":"Benedict Wong","photo":"https://image.tmdb.org/t/p/w500/ukmfsl59Isvn9odgzMWBidA3cmt.jpg","id":30082},{"name":"Jona Xiao","photo":"https://image.tmdb.org/t/p/w500/bEd5FvgkrZloJ0Vb9A3ijEwEV5f.jpg","id":1465325},{"name":"Sandra Oh","photo":"https://image.tmdb.org/t/p/w500/zU8vjebHxcP60ESEL5Ok68KWZvj.jpg","id":25540},{"name":"Thalia Tran","photo":"https://image.tmdb.org/t/p/w500/9JTbJ7wVKkVks4XRfyNCem1jFSO.jpg","id":2782707},{"name":"Lucille Soong","photo":"https://image.tmdb.org/t/p/w500/y5nNpAe0SAfEkxOQldGWWof1fSQ.jpg","id":112288}],"reviews":[{"author":"garethmb","time":"Mar 12021","rate":"0.0","content":"In a magical land known as Kumandra; Humans and Dragons co-exist in harmony. When a threat in the form of creatures known as Druun arrive and threaten to destroy everything; the Dragons combine their power to defeat them but in doing so all but one of the Dragons remains.\r\n\r\nIn the new Disney animated film “Raya and the Last Dragon”; audiences are introduced to the narrative of the story by Raya (Kelly Marie Tran), who tells that the world has become fractured and she is to blame. A sacred relic that the Dragons used to Defeat the Druun has given her kingdom prosperity but the surrounding kingdoms all named after various parts of a Dragon are envious of their position.\r\n\r\nWhen Raya’s father Chief Benja (Daniel Dae Kim); attempts to unite the other kingdoms, a tragic betrayal results in the relic becoming fractured with each kingdom taking a fragment. As if this situation was not bad enough; the fracturing of the relic ushers in the return of the Druun and they quickly resume turning everything not protected by a barrier of water to stone.\r\n\r\nThe story then jumps years into the future where Raya and her faithful companion Tuk Tuk (Alan TudyK) are searching the rivers of the kingdoms in an effort to find the location where the last Dragon Sisu (Awkwafina) is rumored to have been sleeping for 500 years.\r\n\r\nRaya is eventually able to locate Sisu who is a very playful and animated creature and the two set off to save the day by obtaining the missing fragments through any means necessary. Naturally, their journey will be filled with dangers, adventure, and humor, as the various kingdoms have their own unique visual style and characters; some of whom join with Raya on her quest to provide much-needed support, perspective, and at times; humor.\r\n\r\nThe movie is visually amazing as the artists clearly were inspired to create a world that combines elements of many Asian cultures yet has its own unique traits. I marveled at the details of the water and ripples and how the railings on a boat showed uneven discoloration and wear in just a casual scene where the characters talked. It is this attention to detail that really adds to the magic of the film as well as the immersion into fantasy.\r\n\r\nThe supporting cast was great and there are some characters I do not wish to spoil who practically steals every scene in which they are in.  My wife and I were captivated from the very start as Disney has created a film that embodies much of their classic themes and yet expands upon them to create a film the entire family will enjoy.\r\n\r\nThe movie will be released in cinemas and via a paid option for Disney+ subscribers. We attended a press screening at a cinema; our first in almost a year and found the setup to be very safe and it was amazing to see such visual splendor on a big screen.\r\n\r\nDisney has once again created a new classic and has given audiences the magic that they are known for at a time when it is most needed.\r\n\r\n4 stars out of 5.","id":"603d201b33a533004bd1906e"},{"author":"msbreviews","time":"Mar 12021","rate":"3.5","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nDisney purchased Pixar way back in 2006, and many incredible animated films have been released under both banners. Therefore, it’s quite understandable that many people don’t recognize the difference between Walt Disney Animation Studios and Pixar itself. The latter studio released two movies just last year (Onward, Soul), while the former’s latest original film dates back to 2016’s Moana. So, there was a lot of anticipation for a new animated movie from the studio that gave us classics such as Aladdin, The Lion King, Mulan, and more recently, the Frozen saga. With Don Hall (Big Hero 6) and Carlos López Estrada (Blindspotting) at the helm, and Adele Lim (Crazy Rich Asians) and Qui Nguyen (feature-film debut) tackling the screenplay, did they succeed in delivering a good film?\r\n\r\nWell, if I must answer “yes” or “no”, I’ll go with the first one. Let’s start with the positives. The one thing everyone expects from a Disney animated movie is beautiful animation, and Raya and the Last Dragon features tons of gorgeous, creative, jaw-dropping sceneries. The different lands that the story takes the viewers through look impressively realistic, some of them clearly drawing inspiration from real Asian places and culture. The character drawings also look excellent, even though they’re not too far from what we’ve seen from 3D animation in the last few years. \r\n\r\nTechnically though, my standout goes to James Newton Howard’s addictive, chill-inducing score. From the emotional tracks to the riveting tones that elevate every action sequence, it’s a score that I’ll struggle to get out of my head for the next couple of weeks, especially its main theme. In fact, I’m actually listening to it while writing this review, and I’m feeling full of energy. The sound effects for the Druun monsters are pretty eerie, it’s hard not to feel the weight of their threatening presence, but the inspirational, tear-inducing soundtracks leave me floored. The action scenes are wonderfully shot and animated, bringing high levels of entertainment and excitement to a partially adventure-driven narrative. Raya’s sword fighting is indisputably the most captivating type of battle seen throughout the entire runtime.\r\n\r\nStory-wise is where things get a little disappointing, to be completely honest. While the visuals share outstanding imagination and creativity, Adele Lim and Qui Nguyen’s formulaic screenplay is much more straightforward and unsurprising than expected. I knew Raya and the Last Dragon wasn’t going to deliver a groundbreaking narrative, but a videogame-style script is far from being a good alternative. The third act tries to challenge its story’s predictability with one little unexpected moment that I undoubtedly love, but besides not changing the outcome predicted in the first ten minutes of the film, it severely damages a secondary character.\r\n\r\nRegarding this last issue, I can’t deny that it’s my main problem with the movie, but I would have to go into spoiler territory to fully explain it. Therefore, I’ll only address the character’s inconsistency, which unfortunately affects the film’s primary message. The main themes revolve around trust and how if we treat other people kindly, they’ll treat us in the same way. A lovely note that parents will surely want to transmit to their kids, without the shadow of a doubt. However, the character in question spends the movie not knowing where to stand, constantly betraying everyone, and even blaming others for something that same character triggered in the first place.\r\n\r\nDespite having a significantly negative impact on my enjoyment of the film, the ending does work quite well and compensates for my problem with the said character. Kelly Marie Tran lends her voice to Raya, a protagonist easy to root for due to her clear motivations and important mission, while Awkwafina is very funny as Sisu, a goofy dragon with more depth than what the viewers might expect from the first impression. Everyone in the cast delivers extraordinary voice work, and every character has some sort of captivating trait that makes the audience support them, except for you know who. Having in mind that kids are indeed the target audience, I’m positive all will feel delighted with this movie.\r\n\r\nBoasting a predominantly Asian American cast, all delivering exceptional voice work, Raya and the Last Dragon follows a partially disappointing, formulaic narrative but compensates it with stunning animation, a chill-inducing score, and quite a nice ending. Walt Disney Animation Studios returns with an original story that lacks surprising elements, lending all the creativity and imagination to its entertaining, fast-paced adventure packed with undeniably impactful visuals and incredibly riveting action sequences. Despite a significant problem with an inconsistent character that profoundly affects my enjoyment of the film, all other characters are extremely likable, goofy, and well-written. A delightful message about trust and treating others kindly is ultimately well-transmitted to the viewers, which I hope parents will show their kids. Final remark: James Newton Howard’s score will not leave your minds for a long, long time.\r\n\r\nRating: B","id":"603d20a3e267de005151480c"},{"author":"SWITCH.","time":"Mar 82021","rate":"3.5","content":"'Raya and the Last Dragon' is a solid step back in the right direction for Walt Disney Animation Studios. Over the past 20 years, they've struggled to find their confidence and voice as a studio, certainly due to complicated changes of leadership and the rise of genuine artistic and financial competitors, but 'Raya' is the kind of film in which they do their best work - an entertaining and exciting experience built on a strong protagonist with a clear motivation and a powerful internal conflict. The legacy of Disney animation has been to speak to the deep emotional truths of the human experience in a way that is accessible to anyone, and with its themes of self-belief, moving through grief and trauma, and finding the trust in others and ourselves, 'Raya and the Last Dragon' is a worthy part of that legacy.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-raya-and-the-last-dragon-a-solid-return-to-form-for-walt-disney-animation-studios","id":"604589ebca0e17007648b76b"}],"recommends":[{"media":"movie","mediaStr":"Movies","id":464052,"year":"2020","name":"Wonder Woman 1984","poster":"https://image.tmdb.org/t/p/w500/8UlWHLMpgZm9bx6QYh0NFoq67TZ.jpg"},{"media":"movie","mediaStr":"Movies","id":458576,"year":"2020","name":"Monster Hunter","poster":"https://image.tmdb.org/t/p/w500/1UCOF11QCw8kcqvce8LKOO6pimh.jpg"},{"media":"movie","mediaStr":"Movies","id":508442,"year":"2020","name":"Soul","poster":"https://image.tmdb.org/t/p/w500/hm58Jw4Lw8OIeECIq5qyPYhAeRJ.jpg"},{"media":"movie","mediaStr":"Movies","id":587807,"year":"2021","name":"Tom & Jerry","poster":"https://image.tmdb.org/t/p/w500/6KErczPBROQty7QoIsaa6wJYXZi.jpg"},{"media":"movie","mediaStr":"Movies","id":484718,"year":"2021","name":"Coming 2 America","poster":"https://image.tmdb.org/t/p/w500/nWBPLkqNApY5pgrJFMiI9joSI30.jpg"},{"media":"movie","mediaStr":"Movies","id":791373,"year":"2021","name":"Zack Snyder's Justice League","poster":"https://image.tmdb.org/t/p/w500/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg"},{"media":"movie","mediaStr":"Movies","id":340102,"year":"2020","name":"The New Mutants","poster":"https://image.tmdb.org/t/p/w500/xZNw9xxtwbEf25NYoz52KdbXHPM.jpg"},{"media":"movie","mediaStr":"Movies","id":441130,"year":"2020","name":"Wolfwalkers","poster":"https://image.tmdb.org/t/p/w500/ehAKuE48okTuonq6TpsNQj8vFTC.jpg"},{"media":"movie","mediaStr":"Movies","id":508439,"year":"2020","name":"Onward","poster":"https://image.tmdb.org/t/p/w500/f4aul3FyD3jv3v4bul1IrkWZvzq.jpg"},{"media":"movie","mediaStr":"Movies","id":560050,"year":"2020","name":"Over the Moon","poster":"https://image.tmdb.org/t/p/w500/lQfdytwN7eh0tXWjIiMceFdBBvD.jpg"},{"media":"movie","mediaStr":"Movies","id":337401,"year":"2020","name":"Mulan","poster":"https://image.tmdb.org/t/p/w500/aKx1ARwG55zZ0GpRvU2WrGrCG9o.jpg"},{"media":"movie","mediaStr":"Movies","id":602269,"year":"2021","name":"The Little Things","poster":"https://image.tmdb.org/t/p/w500/c7VlGCCgM9GZivKSzBgzuOVxQn7.jpg"},{"media":"movie","mediaStr":"Movies","id":577922,"year":"2020","name":"Tenet","poster":"https://image.tmdb.org/t/p/w500/k68nPLbIST6NP96JmTxmZijEvCA.jpg"},{"media":"movie","mediaStr":"Movies","id":551804,"year":"2020","name":"Freaky","poster":"https://image.tmdb.org/t/p/w500/8xC6QSyxrpm0D5A6iyHNemEWBVe.jpg"},{"media":"movie","mediaStr":"Movies","id":583406,"year":"2021","name":"Judas and the Black Messiah","poster":"https://image.tmdb.org/t/p/w500/iIgr75GoqFxe1X5Wz9siOODGe9u.jpg"},{"media":"movie","mediaStr":"Movies","id":412656,"year":"2021","name":"Chaos Walking","poster":"https://image.tmdb.org/t/p/w500/9kg73Mg8WJKlB9Y2SAJzeDKAnuB.jpg"},{"media":"movie","mediaStr":"Movies","id":581389,"year":"2021","name":"Space Sweepers","poster":"https://image.tmdb.org/t/p/w500/bmemsraCG1kIthY74NjDnnLRT2Q.jpg"},{"media":"movie","mediaStr":"Movies","id":544401,"year":"2021","name":"Cherry","poster":"https://image.tmdb.org/t/p/w500/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg"},{"media":"movie","mediaStr":"Movies","id":581032,"year":"2020","name":"News of the World","poster":"https://image.tmdb.org/t/p/w500/fYQCgVRsQTEfUrP7cW5iAFVYOlh.jpg"},{"media":"movie","mediaStr":"Movies","id":524047,"year":"2020","name":"Greenland","poster":"https://image.tmdb.org/t/p/w500/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg"}]}